Repository: yamarten/atproto-website
Catalog: translation/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: "Blobs" are media files stored alongside an account's repository. They include images, video, and audio, but could also include any other file format. Blobs are referenced by individual records by the **`blob`** lexicon datatype, which includes a content hash (CID) for the blob.
ja: 「blob」はアカウントのリポジトリと共に保存されるメディアファイルです。これらは画像、動画、音声データを含みますが、他のファイル形式も含むことができます。blobは個別のレコードからLexiconの **`blob`** データ型によって参照され、blobのコンテンツハッシュ（CID）を含みます。

source: "Recommended" DID document parameters can be fetched from the new PDS using the `com.atproto.identity.getRecommendedDidCredentials` endpoint. This will include the DID service hostname, local handle (as requested during account creation), a PDS-managed atproto signing key (public key), and (if relevant) PLC rotation keys (public keys).
ja: 推奨されるDIDドキュメントのパラメータは、新PDSの`com.atproto.identity.getRecommendedDidCredentials`エンドポイントから取得できます。これにはDIDのサービスホスト名、ローカルハンドル（アカウント作成時に要求したもの）、PDS管理のatproto署名鍵（公開鍵）、および該当する場合はPLC回転鍵（公開鍵）が含まれます。

source: "{interestsDisplayName}" category (active)
ja: "{interestsDisplayName}" カテゴリー (アクティブ)

source: # Add a repo to track curl -X POST http://localhost:2480/repos/add \ -H "Content-Type: application/json" \ -d '{"dids": ["did:plc:ewvi7nxzyoun6zhxrhs64oiz"]}' # @atproto.com repo ```
ja: # リポジトリを追跡対象に追加 curl -X POST http://localhost:2480/repos/add \ -H "Content-Type: application/json" \ -d '{"dids": ["did:plc:ewvi7nxzyoun6zhxrhs64oiz"]}' # @atproto.comのリポジトリ ```

source: # ATProto for distributed systems engineers
ja: # 分散システムエンジニアのためのATプロトコル

source: # Data Repositories
ja: # データリポジトリ

source: # Data Validation
ja: # データ検証

source: # Glossary of terms
ja: # 用語集

source: # In a separate terminal, connect to receive events: websocat ws://localhost:2480/channel
ja: # 別のターミナルでイベントを受け取るために接続 websocat ws://localhost:2480/channel

source: # Protocol Overview
ja: # プロトコル概要

source: # Quick start guide to building applications on AT Protocol
ja: # ATプロトコルでアプリケーションを構築するためのクイックスタートガイド

source: # Welcome to the Atmosphere
ja: # Atmosphereへようこそ

source: ## **Custom label values**
ja: <Heading level={2} id="custom-label-values">カスタムラベル値</Heading>

source: ## **Global label values**
ja: <Heading level={2} id="global-label-values">グローバルラベル値</Heading>

source: ## **Label configuration**
ja: <Heading level={2} id="label-configurations">ラベル設定</Heading>

source: ## **Label values**
ja: <Heading level={2} id="label-values">ラベル値</Heading>

source: ## API Methods
ja: <Heading level={2} id="api-methods">APIメソッド</Heading>

source: ## API Tokens
ja: <Heading level={2} id="api-tokens">APIトークン</Heading>

source: ## AT Protocol
ja: <Heading level={2} id="at-protocol">ATプロトコル</Heading>

source: ## AT Records
ja: <Heading level={2} id="at-records">ATレコード</Heading>

source: ## ATProto OAuth Example Apps
ja: <Heading level={2} id="atproto-oauth-example-apps">ATプロトコルOAuthサンプルアプリ</Heading>

source: ## About authentication
ja: <Heading level={2} id="about-authentication">認証について</Heading>

source: ## About authorization
ja: <Heading level={2} id="about-authorization">認可について</Heading>

source: ## About backfilling
ja: <Heading level={2} id="about-backfilling">バックフィルとは</Heading>

source: ## About labels
ja: <Heading level={2} id="about-labels">ラベルとは</Heading>

source: ## About lexicons
ja: <Heading level={2} id="about-lexicons">Lexiconとは</Heading>

source: ## About moderation
ja: <Heading level={2} id="about-moderation">モデレーションについて</Heading>

source: ## About social graphs
ja: <Heading level={2} id="about-social-graphs">ソーシャルグラフについて</Heading>

source: ## Account Deactivation
ja: <Heading level={2} id="deactivation">アカウント無効化</Heading>

source: ## Account Deletion
ja: <Heading level={2} id="account-deletion">アカウント削除</Heading>

source: ## Account Migration
ja: <Heading level={2} id="account-migration">アカウント移行</Heading>

source: ## Account Reactivation
ja: <Heading level={2} id="account-reactivation">アカウント再有効化</Heading>

source: ## Account lifecycles
ja: <Heading level={2} id="account-lifecycles">アカウントライフサイクル</Heading>

source: ## Account portability
ja: <Heading level={2} id="account-portability">アカウントの移植性</Heading>

source: ## Achieving Scale
ja: <Heading level={2} id="achieving-scale">スケールの実現</Heading>

source: ## Adversarial use
ja: <Heading level={2} id="adversarial-use">悪意による利用</Heading>

source: ## Algorithmic choice
ja: <Heading level={2} id="algorithmic-choice">アルゴリズムの選択</Heading>

source: ## Algorithmic moderation
ja: <Heading level={2} id="algorithmic-moderation">アルゴリズムによるモデレーション</Heading>

source: ## App Views and Relay
ja: <Heading level={2} id="app-views-and-relay">AppViewとリレー</Heading>

source: ## AppView
ja: <Heading level={2} id="app-view">AppView</Heading>

source: ## AppViews or Relays
ja: <Heading level={2} id="appviews-or-relays">AppViewおよびリレー</Heading>

source: ## Aspect ratios
ja: <Heading level={2} id="Aspect-ratios">アスペクト比</Heading>

source: ## Atmosphere
ja: <Heading level={2} id="atmosphere">Atmosphere</Heading>

source: ## Atproto OAuth Example Apps
ja: <Heading level={2} id="atproto-oauth-example-apps">atproto OAuthサンプルアプリ</Heading>

source: ## Atproto at the intersection of three movements
ja: <Heading level={2} id="atproto-at-the-intersection-of-three-movements">3つのムーブメントの交差点にあるatproto</Heading>

source: ## Backlinks
ja: <Heading level={2} id="backlinks">バックリンク</Heading>

source: ## Backups and Recovery
ja: <Heading level={2} id="backup-and-recovery">バックアップと復旧</Heading>

source: ## Blob
ja: <Heading level={2} id="blob">blob</Heading>

source: ## Blob objects
ja: <Heading level={2} id="blob-object">blobオブジェクト</Heading>

source: ## Build-a-Bot
ja: <Heading level={2} id="build-a-bot">ボット作成</Heading>

source: ## Building practical open systems
ja: <Heading level={2} id="building-practical-open-systems">実用的なオープンシステムの構築</Heading>

source: ## CID (Content ID)
ja: <Heading level={2} id="cid-content-id">CID（コンテンツID）</Heading>

source: ## Charting the flow of data
ja: <Heading level={2} id="charting-the-flow-of-data">データフローを図に表す</Heading>

source: ## Client Sessions
ja: <Heading level={2} id="client-sessions">クライアントセッション</Heading>

source: ## Clients
ja: <Heading level={2} id="clients">クライアント</Heading>

source: ## Collection
ja: <Heading level={2} id="collection">コレクション</Heading>

source: ## Conclusion
ja: <Heading level={2} id="conclusion">結論</Heading>

source: ## Configuring Ozone
ja: <Heading level={2} id="configuring-ozone">Ozoneの設定</Heading>

source: ## Core primitives
ja: <Heading level={2} id="core-primitives">コアプリミティブ</Heading>

source: ## Creating New Account
ja: <Heading level={2} id="creating-new-account">新規アカウント作成</Heading>

source: ## Creating a Client
ja: <Heading level={2} id="creating-a-client">クライアントの生成</Heading>

source: ## Creating a New Account
ja: <Heading level={2} id="creating-a-new-account">新規アカウント作成</Heading>

source: ## Custom Feed Algorithms
ja: <Heading level={2} id="custom-feed-algorithms">カスタムフィードアルゴリズム</Heading>

source: ## Custom Feeds
ja: <Heading level={2} id="custom-feeds">カスタムフィード</Heading>

source: ## DAG-CBOR
ja: <Heading level={2} id="dag-cbor">DAG-CBOR</Heading>

source: ## DID (Decentralized ID)
ja: <Heading level={2} id="did-decentralized-id">DID（分散型識別子）</Heading>

source: ## DID Methods
ja: <Heading level={2} id="did-methods">DIDメソッド</Heading>

source: ## DID PLC
ja: <Heading level={2} id="did-plc">DID PLC</Heading>

source: ## DID Resolution
ja: <Heading level={2} id="did-resolition">DID解決</Heading>

source: ## Data Layout
ja: <Heading level={2} id="data-layout">データレイアウト</Heading>

source: ## Data Repo
ja: <Heading level={2} id="data-repo">データリポジトリ</Heading>

source: ## Data Repositories
ja: <Heading level={2} id="data-repositories">データリポジトリ</Heading>

source: ## Data models
ja: <Heading level={2} id="data-models">データモデル</Heading>

source: ## Decentralized Architecture
ja: <Heading level={2} id="decentralized-architecture">分散アーキテクチャ</Heading>

source: ## Decentralizing our high-scale backend
ja: <Heading level={2} id="decentralizing-our-high-scale-backend">大規模バックエンドの分散化</Heading>

source: ## Declaring a labeler
ja: <Heading level={2} id="declaring-a-labeler">ラベラーの宣言</Heading>

source: ## Deeper reads
ja: <Heading level={2} id="deeper-reads">さらに詳しく</Heading>

source: ## Deleting Records
ja: <Heading level={2} id="deleting-records">レコードの削除</Heading>

source: ## Deleting blobs
ja: <Heading level={2} id="deleting-blobs">blobの削除</Heading>

source: ## Deploy Recipes
ja: <Heading level={2} id="deploy-recipes">デプロイレシピ</Heading>

source: ## Design Patterns
ja: <Heading level={2} id="desugn-paterns">デザインパターン</Heading>

source: ## Documentation
ja: <Heading level={2} id="documentation">ドキュメンテーション</Heading>

source: ## Domain names
ja: <Heading level={2} id="domain-names">ドメイン名</Heading>

source: ## Example Feeds
ja: <Heading level={2} id="example-feeds">フィードの例</Heading>

source: ## Feed Feedback
ja: <Heading level={2} id="feed-feedback">フィードのフィードバック</Heading>

source: ## Feed Generator Templates
ja: <Heading level={2} id="feed-generator-templates">フィードジェネレーターテンプレート</Heading>

source: ## Feeds
ja: <Heading level={2} id="feeds">フィード</Heading>

source: ## Finalizing Account Status
ja: <Heading level={2} id="finalizing-account-status">アカウント状態確定</Heading>

source: ## Firehose
ja: <Heading level={2} id="firehose">firehose</Heading>

source: ## For Lexicon designers
ja: <Heading level={2} id="for-lexicon-designers">Lexicon設計者向け</Heading>

source: ## For app developers
ja: <Heading level={2} id="for-app-developers">アプリ開発者向け</Heading>

source: ## Further Reading and Resources
ja: <Heading level={2} id="further-reading-and-resources">関連・参考資料</Heading>

source: ## Garbage collecting
ja: <Heading level={2} id="garbage-collection">ガベージコレクション</Heading>

source: ## Getting Records
ja: <Heading level={2} id="getting-records">レコードの取得</Heading>

source: ## Getting started
ja: <Heading level={2} id="getting-started">はじめる</Heading>

source: ## Go
ja: <Heading level={2} id="go">Go</Heading>

source: ## HTTP API methods
ja: <Heading level={2} id="http-api-methods">HTTP APIメソッド</Heading>

source: ## HTTP requests
ja: <Heading level={2} id="http-requests">HTTPリクエスト</Heading>

source: ## Handle
ja: <Heading level={2} id="handle">ハンドル</Heading>

source: ## Handle Resolution
ja: <Heading level={2} id="handle-resolution">ハンドル解決</Heading>

source: ## Handles and DIDs
ja: <Heading level={2} id="handles-and-dids">ハンドルとDID</Heading>

source: ## How backfilling works
ja: <Heading level={2} id="how-backfilling-works">バックフィルの仕組み</Heading>

source: ## How is OAuth Different in AT Protocol?
ja: <Heading level={2} id="how-is-oauth-different-in-at-protocol">ATプロトコルのOAuthは何が違う？</Heading>

source: ## Identifier Types
ja: <Heading level={2} id="identifier-types">識別子の種類</Heading>

source: ## Identifiers
ja: <Heading level={2} id="identifiers">識別子</Heading>

source: ## Identity
ja: <Heading level={2} id="identity">ID</Heading>

source: ## Implementing Feeds
ja: <Heading level={2} id="implementing-feeds">フィードの実装</Heading>

source: ## Implementing OAuth Scopes
ja: <Heading level={2} id="implementing-oauth-scopes">OAuthスコープの実装</Heading>

source: ## Innovations
ja: <Heading level={2} id="innovations">イノベーション</Heading>

source: ## Installing Ozone
ja: <Heading level={2} id="installing-ozone">Ozoneのインストール</Heading>

source: ## Interoperation
ja: <Heading level={2} id="interoperation">相互運用</Heading>

source: ## Introduction
ja: <Heading level={2} id="introduction">はじめに</Heading>

source: ## Is the AT Protocol a blockchain?
ja: <Heading level={2} id="is-the-at-protocol-a-blockchain">ATプロトコルはブロックチェーンですか？</Heading>

source: ## Jetstream
ja: <Heading level={2} id="jetstream">Jetstream</Heading>

source: ## Label
ja: <Heading level={2} id="label">ラベル</Heading>

source: ## Labeler Subscriptions
ja: <Heading level={2} id="labeler-subscriptions">ラベラー登録</Heading>

source: ## Language Handling
ja: <Heading level={2} id="language-handling">使用言語対応</Heading>

source: ## Lexhub
ja: <Heading level={2} id="lexhub">Lexhub</Heading>

source: ## Lexicon
ja: <Heading level={2} id="lexicon">Lexicon</Heading>

source: ## Lexicon evolution
ja: <Heading level={2} id="lexicon-evolition">Lexiconの進化</Heading>

source: ## Linting and validating
ja: <Heading level={2} id="linting-and-validating">リントとバリデーション</Heading>

source: ## Listing Records
ja: <Heading level={2} id="listing-records">レコードの列挙</Heading>

source: ## Looking for the Bluesky API docs?
ja: <Heading level={2} id="looking-for-the-bluesky-api-docs">Bluesky APIドキュメントをお探しですか？</Heading>

source: ## Making it happen
ja: <Heading level={2} id="making-it-happen">使い方</Heading>

source: ## Metadata
ja: <Heading level={2} id="metadata">メタデータ</Heading>

source: ## Migrating Data
ja: <Heading level={2} id="migrating-data">データ移行</Heading>

source: ## Moderation
ja: <Heading level={2} id="moderation">モデレーション</Heading>

source: ## NSID (Namespaced ID)
ja: <Heading level={2} id="nsid-namespaced-id">NSID（名前空間ID）</Heading>

source: ## Naming conventions
ja: <Heading level={2} id="naming-conventions">命名規則</Heading>

source: ## Network Architecture
ja: <Heading level={2} id="network-architecture">ネットワークアーキテクチャ</Heading>

source: ## New Account Creation
ja: <Heading level={2} id="new-account-creation">新規アカウント作成</Heading>

source: ## Next steps
ja: <Heading level={2} id="next-steps">次のステップ</Heading>

source: ## OAuth flow examples
ja: <Heading level={2} id="oauth-flow-examples">OAuthフローの例</Heading>

source: ## OAuth with NextJS
ja: <Heading level={2} id="oauth-with-nextjs">NextJSでOAuth</Heading>

source: ## Object storage
ja: <Heading level={2} id="object-storage">オブジェクトストレージ</Heading>

source: ## Opinionated takes
ja: <Heading level={2} id="opinionated-takes">こだわりの表明</Heading>

source: ## Osprey and Ozone
ja: <Heading level={2} id="osprey-and-ozone">OspreyとOzone</Heading>

source: ## Other guidelines
ja: <Heading level={2} id="other-guidelines">その他のガイドライン</Heading>

source: ## Overview
ja: <Heading level={2} id="overview">概要</Heading>

source: ## Ozone
ja: <Heading level={2} id="ozone">Ozone</Heading>

source: ## Ozone and Osprey
ja: <Heading level={2} id="ozone-and-osprey">OzoneとOsprey</Heading>

source: ## PDS
ja: <Heading level={2} id="pds">PDS</Heading>

source: ## PDS (Personal Data Server)
ja: <Heading level={2} id="pds-personal-data-server">PDS（パーソナルデータサーバー）</Heading>

source: ## PLC key management
ja: <Heading level={2} id="plc-key-management">PLC鍵管理</Heading>

source: ## Part 1: Lexicons
ja: <Heading level={2} id="part-1-lexicons">パート1：Lexion</Heading>

source: ## Part 1: Lexicons and Tap
ja: <Heading level={2} id="part-1-lexicons-and-tap">パート1：LexionとTap</Heading>

source: ## Part 1: Project Setup
ja: <Heading level={2} id="part-1-project-setup">パート1：セットアップ</Heading>

source: ## Part 2: Create a Bot
ja: <Heading level={2} id="part-2-create-a-bot">パート2：ボット作成</Heading>

source: ## Part 2: Database Schema
ja: <Heading level={2} id="part-2-database-schema">パート2：データベーススキーマ</Heading>

source: ## Part 2: Feed Structure
ja: <Heading level={2} id="part-2-feed-structure">パート2：フィードの構成</Heading>

source: ## Part 2: Implementing OAuth
ja: <Heading level={2} id="part-2-implementing-oauth">パート2：OAuthの実装</Heading>

source: ## Part 3: Adding Database Persistence
ja: <Heading level={2} id="part-3-adding-database-persistence">パート3：データベース永続化の追加</Heading>

source: ## Part 3: Consuming the Firehose
ja: <Heading level={2} id="part-3-consuming-the-firehose">パート3：firehose取り込み</Heading>

source: ## Part 3: Run the Bot
ja: <Heading level={2} id="part-3-run-the-bot">パート3：ボット実行</Heading>

source: ## Part 3: Status Submission
ja: <Heading level={2} id="part-3-status-submission">パート3：ステータス投稿</Heading>

source: ## Part 4: Deploying to Production
ja: <Heading level={2} id="part-4-deploying-to-production">パート4：本番環境へのデプロイ</Heading>

source: ## Part 4: From Bot to Agent
ja: <Heading level={2} id="part-4-from-bot-to-agent">パート4：ボットからエージェントへ</Heading>

source: ## Part 4: Realtime Sync with Tap
ja: <Heading level={2} id="part-4-realtime-sync-with-tap">パート4：Tapによるリアルタイム同期</Heading>

source: ## Part 4: Serving the Feed
ja: <Heading level={2} id="part-4-serving-the-feed">パート4：フィード配信</Heading>

source: ## Part 5: Displaying Handles and Feeds
ja: <Heading level={2} id="part-5-displaying-handles-and-feeds">パート5：ハンドルとフィードの表示</Heading>

source: ## Part 5: Running the Server
ja: <Heading level={2} id="part-5-running-the-server">パート5：サーバー起動</Heading>

source: ## Password Authentication
ja: <Heading level={2} id="password-authentication">パスワード認証</Heading>

source: ## Permission Set design
ja: <Heading level={2} id="permission-set-design">権限セットの設計</Heading>

source: ## Permission types
ja: <Heading level={2} id="permission-types">権限の種類</Heading>

source: ## Prerequisites
ja: <Heading level={2} id="prerequisites">前提条件</Heading>

source: ## Querying social graphs
ja: <Heading level={2} id="querying-social-graphs">ソーシャルグラフの取得</Heading>

source: ## Rate limits
ja: <Heading level={2} id="rate-limits">レート制限</Heading>

source: ## Read-after-Write
ja: <Heading level={2} id="read-after-write">read-after-write</Heading>

source: ## Recommended Data Limits
ja: <Heading level={2} id="recommended-data-limits">推奨データ制限</Heading>

source: ## Record
ja: <Heading level={2} id="record">レコード</Heading>

source: ## Record types
ja: <Heading level={2} id="record-types">レコード型</Heading>

source: ## Referencing blobs
ja: <Heading level={2} id="referencing-blobs">blobの参照</Heading>

source: ## Related resources
ja: <Heading level={2} id="related-resources">参考資料</Heading>

source: ## Relay
ja: <Heading level={2} id="relay">リレー</Heading>

source: ## Reporting
ja: <Heading level={2} id="reporting">報告</Heading>

source: ## Requesting permissions
ja: <Heading level={2} id="requesting-permissions">権限の要求</Heading>

source: ## Revising Permission Sets
ja: <Heading level={2} id="revising-permission-sets">権限セットの改訂</Heading>

source: ## Rolling out changes
ja: <Heading level={2} id="rolling-out-changes">変更の展開</Heading>

source: ## Scaling the traditional Web backend
ja: <Heading level={2} id="scaling-the-traditional-web-backend">従来のウェブバックエンドのスケーリング</Heading>

source: ## Specifications
ja: <Heading level={2} id="specifications">仕様</Heading>

source: ## Speech, reach, and moderation
ja: <Heading level={2} id="speech-reach-and-moderation">スピーチ、リーチ、モデレーション</Heading>

source: ## Statusphere Example App
ja: <Heading level={2} id="statusphere-example-apps">Statusphereサンプルアプリ</Heading>

source: ## Step 1. Starting with our ExpressJS app
ja: <Heading level={2} id="step-1-starting-with-our-expressjs-app">ステップ1. ExpressJSアプリから始める</Heading>

source: ## Step 2. Signing in with OAuth
ja: <Heading level={2} id="step-2-signing-in-with-oauth">ステップ2. OAuthでサインイン</Heading>

source: ## Step 3. Fetching the user's profile
ja: <Heading level={2} id="step-3-fetching-the-users-profile">ステップ3. ユーザーのプロフィールを取得する</Heading>

source: ## Step 4. Reading & writing records
ja: <Heading level={2} id="step-4-reading-writing-records">ステップ4. レコードの読み取りと書き込み</Heading>

source: ## Step 5. Creating a custom "status" schema
ja: <Heading level={2} id="step-5-creating-a-custom-status-schema">ステップ5. カスタムの「ステータス」スキーマの作成</Heading>

source: ## Step 6. Listening to the firehose
ja: <Heading level={2} id="step-6-listening-to-the-firehose">ステップ6. ファイアホースをリッスン</Heading>

source: ## Step 7. Listing the latest statuses
ja: <Heading level={2} id="step-7-listing-the-latest-statuses">ステップ7. 最新のステータスを一覧表示する</Heading>

source: ## Step 8. Optimistic updates
ja: <Heading level={2} id="step-8-optimistic-updates">ステップ8. 楽観的更新</Heading>

source: ## Streaming data
ja: <Heading level={2} id="streaming-data">データストリーミング</Heading>

source: ## Submitting and managing reports
ja: <Heading level={2} id="submitting-and-managing-reports">報告の送信と管理</Heading>

source: ## TID (Timestamp ID)
ja: <Heading level={2} id="tid-timestamp-id">TID（タイムスタンプID）</Heading>

source: ## TL;DR
ja: <Heading level={2} id="tl-dr">要約</Heading>

source: ## Tap
ja: <Heading level={2} id="tap">Tap</Heading>

source: ## The Authenticated Transfer Protocol
ja: <Heading level={2} id="the-authenticated-transfer-protocol">Authenticated Transferプロトコル</Heading>

source: ## The stack
ja: <Heading level={2} id="the-stack">スタック</Heading>

source: ## Thinking in AT Proto
ja: <Heading level={2} id="thinking-in-at-proto">ATプロトコル的に考える</Heading>

source: ## Tools and SDKs
ja: <Heading level={2} id="tools-and-sdks">ツールとSDK</Heading>

source: ## Transcoding
ja: <Heading level={2} id="transcoding">トランスコーディング</Heading>

source: ## TypeScript
ja: <Heading level={2} id="typescript">TypeScript</Heading>

source: ## Types of App
ja: <Heading level={2} id="types-of-app">アプリケーションの種類</Heading>

source: ## Typescript
ja: <Heading level={2} id="typescript">Typescript</Heading>

source: ## Unauthenticated Reads
ja: <Heading level={2} id="unauthenticated-reads">認証無しの読み取り</Heading>

source: ## Unifying the data model
ja: <Heading level={2} id="unifying-the-data-model">データモデルの統合</Heading>

source: ## Updating Identity
ja: <Heading level={2} id="updating-identity">ID更新</Heading>

source: ## Updating Records
ja: <Heading level={2} id="updating-records">レコードの更新</Heading>

source: ## Uploading blobs
ja: <Heading level={2} id="uploading-blob">blobのアップロード</Heading>

source: ## Use labels in your app
ja: <Heading level={2} id="use-labelers-in-your-app">アプリでラベルを使う</Heading>

source: ## Using goat
ja: <Heading level={2} id="using-goat">goatの利用</Heading>

source: ## Using lex
ja: <Heading level={2} id="using-lex">lexの利用</Heading>

source: ## Using tap
ja: <Heading level={2} id="using-tap">tapの利用</Heading>

source: ## Validation Without Schema
ja: <Heading level={2} id="validation-without-schema">スキーマ無しのバリデーション</Heading>

source: ## Versioning
ja: <Heading level={2} id="versioning">バージョニング</Heading>

source: ## Video uploads
ja: <Heading level={2} id="video-uploads">動画のアップロード</Heading>

source: ## Web accessibility
ja: <Heading level={2} id="web-accessibillity">ウェブアクセシビリティ</Heading>

source: ## What *is* OAuth?
ja: <Heading level={2} id="what-is-oauth">OAuthとは？</Heading>

source: ## What is “XRPC,” and why not use ___?
ja: <Heading level={2} id="what-is-xrpc-and-why-not-use-___">XRPCとは何ですか。なぜ___を使用しないのですか?</Heading>

source: ## Why create Lexicon instead of using JSON-LD or RDF?
ja: <Heading level={2} id="why-create-lexicon-instead-of-using-json-ld-or-rdf">JSON-LDやRDFを使用する代わりにLexiconを作成する理由</Heading>

source: ## Why not use ActivityPub?
ja: <Heading level={2} id="why-not-use-activitypub">ActivityPubを使用しないのはなぜですか？</Heading>

source: ## Writing Data
ja: <Heading level={2} id="writing-data">データ書き込み</Heading>

source: ## XRPC
ja: <Heading level={2} id="xrpc">XRPC</Heading>

source: ### Data-intensive distributed systems
ja: <Heading level={3} id="data-intensive-ditributed-systems">データ集約型の分散システム</Heading>

source: ### Example: Hosting service
ja: <Heading level={3} id="example-hosting-service">例：ホスティングサービス</Heading>

source: ### Example: Self-hosted
ja: <Heading level={3} id="example-self-hosting">例：セルフホスト</Heading>

source: ### Generic hosting, Centralized product development
ja: <Heading level={3} id="generic-hosting-centralized-product-development">汎用ホスティングと集権型プロダクト開発</Heading>

source: ### Identity-based authority
ja: <Heading level={3} id="identity-based-authority">IDに基づく権威</Heading>

source: ### Lazy trust
ja: <Heading level={3} id="lazy-trust">後回し信頼</Heading>

source: ### Peer-to-peer
ja: <Heading level={3} id="peer-to-peer">ピアツーピア</Heading>

source: ### Structure gives freedom
ja: <Heading level={3} id="structure-gives-freedom">構造が自由をもたらす</Heading>

source: ### Synthesis Atproto is situated as the synthesis of these three movements.
ja: <Heading level={3} id="synthesis">統合</Heading> atprotoは、3つのムーブメントを統合したものとして位置づけられます。

source: ### The web
ja: <Heading level={3} id="the-web">ウェブ</Heading>

source: ### TypeScript
ja: <Heading level={3} id="typescript">TypeScript</Heading>
